_posts/2017-07-12-Zeromq-bindings-for-Emacs-via-dynamic-modules.html
---
title: Zeromq bindings for Emacs via dynamic modules
date: 2017/07/12 07:38:28
updated: 2017/07/12 07:38:28
categories: emacs,dynamic-module
tags: 
---


<p>
I do a lot of scientific programming, and it is one of the reasons I have been learning to extend Emacs with dynamic modules. They have allowed me to add physical constants, numerical integration, root finding and linear algebra from established c-libraries to Emacs. Today I am taking a break from that and finally getting to another one of the reasons I started playing around with dynamic modules: <a href="http://zguide.zeromq.org/">zeromq</a>. Zeromq is a messaging library that <a href="http://jupyter-client.readthedocs.io/en/latest/messaging.html">Jupyter</a> uses to communicate with kernels. I thought we might get a smoother integration with Emacs and Jupyter if we could use zeromq directly to communicate between org-mode and the kernel. Currently we have to run a web server that does the communication for us via http requests. We won't solve the Jupyter problem today, but we will look at communicating with a Zeromq server from Emacs.
</p>

<p>
This might have lots of other useful applications. Suppose Emacs could communicate directly with other zeromq servers to retrieve data from, perhaps scientific data. It might even be possible for Emacs to run its own zeromq server, and other instances of Emacs could then communicate with it. Collaborative editing anyone? 
</p>

<p>
Here we just implement the "Hello world" client example in the <a href="http://zguide.zeromq.org/page:all#Ask-and-Ye-Shall-Receive">zeromq guide</a>. The code for the server, a c-client, the mod-zmq library, a makefile and tests can be found at <a href="https://github.com/jkitchin/emacs-modules/tree/master/zeromq">https://github.com/jkitchin/emacs-modules/tree/master/zeromq</a>. All the server does is receive a string, and then send a response (in this case just the string "World") back to the client. 
</p>

<p>
To run this, make sure to run the hwserver executable in a terminal. I wrapped the  zeromq commands required to implement the client into a dynamic module. Since this example focuses on strings, the module returns strings to Emacs. I am not sure if that is always the right thing to do, as zeromq more generically uses bytes, but I will have to wait until I know more about zeromq to know if this is an issue. 
</p>

<p>
This dynamic module uses a new feature that none of the previous posts used, and that is the user_ptr. These allow you to essentially return a reference pointer back to emacs that you can pass back to another function. That way they stay alive between function calls. For example, here we have to create a context and socket and pass these items to functions like zmq_send and zmq_recv.
</p>

<p>
The directory this library is in is not on my path, so we load it like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path (expand-file-name <span style="color: #008000;">"."</span>))
(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">mod-zmq</span>)
</pre>
</div>

<p>
Here are the functions and their signatures that have been implemented so far. I only implemented the ones I needed for the client. The signatures may change in the future; this is just a proof of concept for now for the purpose of building the client.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(apropos-command <span style="color: #008000;">"zmq*"</span> t)
(<span style="color: #0000FF;">with-current-buffer</span> <span style="color: #008000;">"*Apropos*"</span> (buffer-string))
</pre>
</div>

<pre class="example">
Type RET on a type label to view its full documentation.

zmq-close
  Function: (zmq-close SOCKET)
zmq-connect
  Function: (zmq-connect SOCKET ENDPOINT)
zmq-ctx-destroy
  Function: (zmq-ctx-destroy CONTEXT)
zmq-ctx-new
  Function: (zmq-ctx-new)
zmq-recv
  Function: (zmq-recv SOCKET LEN FLAGS)
zmq-send
  Function: (zmq-send SOCKET BUF FLAGS)
zmq-socket
  Function: (zmq-socket CONTEXT TYPE)
</pre>

<p>
You can see the c code for the client here: <a href="/media/hwclient.c">hwclient.c</a> . Here is a simple elisp version of the hwclient that basically does the same thing! The main difference is I added a while loop around the zmq-recv because sometimes it returns -1 and no result. So, here we loop until the return result is not -1. That seems to do the right thing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">let*</span> ((context (zmq-ctx-new))
       (socket (zmq-socket context ZMQ-REQ))
       (recv-ret -1)
       (result))

  (zmq-connect socket <span style="color: #008000;">"tcp://localhost:5555"</span>)
  (zmq-send socket <span style="color: #008000;">"Hello"</span> 0)

  (<span style="color: #0000FF;">while</span> (= recv-ret -1)
    (<span style="color: #0000FF;">setq</span> result (zmq-recv socket 10 0)
          recv-ret (second result)))

  (print result)

  (zmq-close socket)
  (zmq-ctx-destroy context))
</pre>
</div>

<pre class="example">

("World" 5)

</pre>

<p>
Basically this creates the context, then the socket, and connects to it on port 5555 of the localhost where the server is running. Then we send the string "Hello". The server returns the string "World" and tells us it sent 5 bytes. Then we close the socket and destroy the context. There is a lot of code in the module to make this happen. A lot of it is converting args in emacs functions to things we can use in c, running a few lines of zmq commands, and then code to convert those results back to emacs values. Finally, there is code to register each function and define docstrings for them. I am not totally convinced this is the best way to do this, but it does work! An alternative might be <a href="https://github.com/tromey/emacs-ffi">emacs-ffi</a>, which might enable most of this to be developed in just elisp. 
</p>
<p>Copyright (C) 2017 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2017/07/12/Zeromq-bindings-for-Emacs-via-dynamic-modules.org">org-mode source</a></p>
<p>Org-mode version = 9.0.7</p>